#+TITLE: The youtube-dl playlist compendium
#+SUBTITLE: Save a local copy of a youtube playlist and integrate with jellyfin

Requirements:
- access to youtube
- ytcc (optional)
- ffmpeg
- youtube-dl
- emby/yellyfin (optional)

The available metadata dependes on the extractor. I have an additional level of control if I can extract metadata from video titles that might not be captured by the extractor. ll

In fact, every set of videos can be downloaded as a playlist, because all videos form a channel are a playlist themself (names "Uploads from <channel name>"), and youtube-dl can arbitrarily filter this list. So a playlist is not just what that uploader has defined as a playlist, but what you choose to be.

First just download the titles of the playlist:
#+begin_src bash :results value verbatim :format: raw
youtube-dl --get-title PLzH6n4zXuckpfMu_4Ff8E7Z1behQks5ba
#+end_src

#+RESULTS:
: 0
Data Analysis 0: Introduction to Data Analysis - Computerphile
Data Analysis 1: What is Data? - Computerphile
Data Analysis 2: Data Visualisation - Computerphile
Data Analysis 3: Cleaning Data - Computerphile
Data Analysis 4: Data Transformation - Computerphile
Data Analysis 5: Data Reduction - Computerphile
Data Analysis 6: Principal Component Analysis (PCA) - Computerphile
Data Analysis 7: Clustering - Computerphile
Data Analysis 8: Classifying Data - Computerphile
Data Analysis 9: Data Regression - Computerphile

Now use this for `--metadata-from-title`

#+begin_src bash 
youtube-dl --get-filename https://www.youtube.com/playlist?list=PLzH6n4zXuckpfMu_4Ff8E7Z1behQks5ba -o '/media/chriad/YOUTUBE-dl/YOUTUBE-PLAYLISTS/%(channel)s/%(playlist)s/%(playlist_index)s - %(title)s.%(ext)s'
#+end_src

Now use this output for `--exec ... {}` to remove unnecessary stuff from filename.

Look at embedded metadata:

#+begin_src bash 
ffmpeg -i 'The Privacy Tax - How tracking and hacking affect disabled people, and what we can do about it.mkv' -f ffmetadata - 2> /dev/null
#+end_src

Maybe conform to jellyfin naming?

#+begin_src bash
youtube-dl --get-filename https://www.youtube.com/playlist?list=PLzH6n4zXuckpfMu_4Ff8E7Z1behQks5ba -o '/media/chriad/YOUTUBE-dl/YOUTUBE-PLAYLISTS/%(channel)s/%(playlist)s - S01E%(playlist_index)s - %(title)s.%(ext)s'
#+end_src

Case study: using `--metadata-from-title`

What metadata can we extract?
youtube-dl -j

To look for metadata in the json file, I can highly recommand [[https://developer.github.com/v3/repos/statistics/][jid]] bla.

** Making youtube-dl playlists work with jellyfin

# complete playlist metadate
youtube-dl --dump-single-json `ytcc -o xsv subscriptions -a name,url | grep 'Mastering'|cut -f2 -d','` | jid

youtube-dl --dump-single-json --sub-lang en `ytcc -o xsv subscriptions -a name,url | grep 'Mastering'|cut -f2 -d','` | jq '.entries[].upload_date'

# merge per file metadata
cat *.info.json | json --group | jq '.[].upload_date' 

** nfo


** Projects of interest
- https://github.com/ankenyr/jellyfin-youtube-metadata-plugin.git
- https://stackoverflow.com/a/67144906/2376000 -> another degree of freedem by calling youtube-dl multiple times in one shell script
